<a href="https://colab.research.google.com/github/JoanNjoki/MTN/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2021_03_Joan_Mwangi_Python_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **MTN COTE D'IVOIRE DATA ANALYSIS**

###1.Importing libraries into the environment

In [ ]:
#loading pandas and numpy library
import pandas as pd

###2.Loading the 6 datasets into the environment

#####2.1 Cells geo description dataset

In [ ]:
#loading the 'cell geo description' excel file
df1 = pd.read_excel('/content/cells_geo_description.xlsx')
# previewing the dataframe
df1.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

#####2.2 Cells geo dataset

In [ ]:
#load the 'cells geo'csv file
df2 = pd.read_csv('/content/cells_geo.csv',delimiter=';',index_col=0)
#previewing the dataset
df2.head()

    VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

#####2.3 CDR Description dataset and Telecom Datasets 1,2 and 3

In [ ]:
#loading the 'CDR description' excel file
df3 = pd.read_excel('/content/CDR_description.xlsx')
# previewing the dataset 
df3

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

######Telecom Dataset 1, 2 and 3

In [ ]:
#loading the 'Telecom Dataset 1' csv file
df4 = pd.read_csv('/content/Telcom_dataset.csv')
# previewing the dataset 
df4.head(2)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [ ]:
#loading the 'Telecom dataset 2' csv file
df5 = pd.read_csv('/content/Telcom_dataset2.csv')
# previewing the dataset 
df5.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#loading the 'Telecom dataset 3' csv file
df6 = pd.read_csv('/content/Telcom_dataset3.csv')
# previewing the dataset
df6.tail()

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
4996   Voice      0  2012-05-09 00:01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4997   Voice     62  2012-05-09 00:01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
4999   Voice     30  2012-05-09 00:01:43.0  ...     19e2e  98ed726da2  b4130b54ab
5000   Voice     60  2012-05-09 00:01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[5 rows x 10 columns]

###3.1 Data Cleaning

#####3.1.1 Renaming columns

In [ ]:
#Renaming the column names in Telecom dataset 1 'DW_A_NUMBER' & 'DW_B_NUMBER' and adding _INT at the end
df4.rename(columns={'PRODUTC':'PRODUCT'},inplace=True)
#previewing the dataset df5 to view the changes made
df4.head(2)

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [ ]:
#Renaming the column names in Telecom dataset 1 'DATETIME' & 'DATE_TIME' 
#to ease the merging process
df4.rename(columns={'DATETIME':'DATE_TIME'},inplace=True)
#previewing the dataset df5 to view the changes made
df4.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [ ]:
#Renaming the column names in Telecom dataset 2 'DW_A_NUMBER' & 'DW_B_NUMBER' and adding _INT at the end
#for easing merging
df5.rename(columns={'DW_A_NUMBER':'DW_A_NUMBER_INT','DW_B_NUMBER':'DW_B_NUMBER_INT'},inplace=True)
#previewing the dataset df5 to view the changes made
df5.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

In [ ]:
#Renaming the column names in Telecom dataset 3 'SIET' & 'SITE' 
#for easing merging
df6.rename(columns={'SIET_ID':'SITE_ID'},inplace=True)
#previewing the dataset df5 to view the changes made
df6.head(2)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 7 columns]

In [ ]:
#Renaming the column names in Telecom dataset 3 'SIET' & 'SITE' 
#for easing merging
df6.rename(columns={'CELLID':'CELL_ID'},inplace=True)
#previewing the dataset df5 to view the changes made
df6.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx

[2 rows x 10 columns]

#####3.1.2 Dropping columns Country A and B in the 3 Telecom Datasets

In [ ]:
#Dropping columns country A and B in telecom dataset 1 and the previewing the output
df4.drop('COUNTRY_A',axis=1,inplace=True)
df4.drop('COUNTRY_B',axis=1,inplace=True)
df4.drop('CELL_ON_SITE',axis=1,inplace=True)
df4

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  ...  /+cKZKIp41  /+cKZKIp41
2        sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  ...  051KhYDCpv  051KhYDCpv
...      ...    ...  ...         ...         ...
4996     sms    100  ...  0c2371d9bc  1e751d08a4
4997   Voice      1  ...  5fb791cf56  65efe2bc62
4998   Voice      0  ...  7773627c12  9ef9616350
4999   Voice      0  ...  3f4af49d6c  969b8d0e39
5000   Voice      7  ...  6f4d9b77a5  ebfc58af70

[5001 rows x 7 columns]

In [ ]:
#Dropping columns country A and B in telecom dataset 2 and the previewing the output
df5.drop('COUNTRY_A',axis=1,inplace=True)
df5.drop('COUNTRY_B',axis=1,inplace=True)
df5.drop('CELL_ON_SITE',axis=1,inplace=True)
df5.head()

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q
3   Voice     37  ...  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  ...  +bO+qkSonO  +bO+qkSonO

[5 rows x 7 columns]

In [ ]:
#Dropping columns country A and B in telecom dataset 3 and the previewing the output
df6.drop('COUNTRY_A',axis=1,inplace=True)
df6.drop('COUNTRY_B',axis=1,inplace=True)
df6.drop('CELL_ON_SITE',axis=1,inplace=True)
df6

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0      Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1        sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2      Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+
3        sms      0  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     22  ...  /eeMklgyJA  /eeMklgyJA
...      ...    ...  ...         ...         ...
4996   Voice      0  ...  2aa04dcab7  f7d63a29e5
4997   Voice     62  ...  7f1f2f889f  b4ddb9e93c
4998   Voice     32  ...  a4731e780e  d68260ef50
4999   Voice     30  ...  98ed726da2  b4130b54ab
5000   Voice     60  ...  1c11a2fcbb  6d70dae094

[5001 rows x 7 columns]

#####splitting the Datetime column

In [ ]:
#spliting "DATE_TIME column" to date and time
df_new_cleaned = df_new[['DATE', 'TIME']] = df_new.DATE_TIME.str.split(expand=True)
df_new_cleaned

                0           1
0      2012-05-06  23:04:37.0
1      2012-05-06  23:05:25.0
2      2012-05-06  23:05:41.0
3      2012-05-06  23:05:42.0
4      2012-05-06  23:06:29.0
...           ...         ...
14998  2012-05-09  00:01:43.0
14999  2012-05-09  00:01:43.0
15000  2012-05-09  00:01:43.0
15001  2012-05-09  00:01:43.0
15002  2012-05-09  00:01:43.0

[15003 rows x 2 columns]

###3.2 Merging the three Telecom datasets onto Cell_geo Dataset

In [ ]:
#Merging the 3 telecom dataset using the concat function as df_merge
df_merge = pd.concat([df4,df5,df6], axis = 0,ignore_index = True)
#previewing the dataset
df_merge.head(2)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41

[2 rows x 7 columns]

In [ ]:
#merging the dataset
df_new = pd.concat([df2,df_merge], axis = 1)
df_new.head(2)

   VILLES      STATUS LOCALISATION  ...  DW_B_NUMBER_INT     CELL_ID     SITE_ID
0  ADJAME  In Service      ABIDJAN  ...  1a49f8b0ded9de6  /TJNe+Mmtu  /TJNe+Mmtu
1  ADJAME  In Service      ABIDJAN  ...  93343ba6e41af95  /+cKZKIp41  /+cKZKIp41

[2 rows x 18 columns]

In [ ]:
#getting info from the merged datasets
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15003 entries, 0 to 15002
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   VILLES           3974 non-null   object
 1   STATUS           3907 non-null   object
 2   LOCALISATION     3974 non-null   object
 3   DECOUPZONE       3974 non-null   object
 4   ZONENAME         3968 non-null   object
 5   LONGITUDE        3974 non-null   float64
 6   LATITUDE         3974 non-null   float64
 7   REGION           3974 non-null   object
 8   AREA             3951 non-null   object
 9   CELL_ID          3974 non-null   object
 10  SITE_CODE        3974 non-null   object
 11  PRODUCT          15003 non-null  object
 12  VALUE            15003 non-null  int64
 13  DATE_TIME        15003 non-null  object
 14  DW_A_NUMBER_INT  15003 non-null  object
 15  DW_B_NUMBER_INT  10002 non-null  object
 16  CELL_ID          15003 non-null  object
 17  SITE_ID          13006 non-null  object
 18  DW_B_NUMBER      5001 non-null   object
dtypes: float64(2), int64(1), object(16)
memory usage: 2.3+ MB

#####checking for mising values in the new merged dataset

In [ ]:
#checking for missing values in the merged telecom dataset
df_merge.isnull().sum()

PRODUCT               0
VALUE                 0
DATE_TIME             0
DW_A_NUMBER_INT       0
DW_B_NUMBER_INT       0
CELL_ID               0
SITE_ID            1997
dtype: int64

In [ ]:
#checking for missing values in the (Merged Telecom Dataset)+ (Cell Geo Dataset)
df_new.isnull().sum()

VILLES             11029
STATUS             11096
LOCALISATION       11029
DECOUPZONE         11029
ZONENAME           11035
LONGITUDE          11029
LATITUDE           11029
REGION             11029
AREA               11052
CELL_ID            11029
SITE_CODE          11029
PRODUCT                0
VALUE                  0
DATE_TIME              0
DW_A_NUMBER_INT        0
DW_B_NUMBER_INT        0
CELL_ID                0
SITE_ID             1997
dtype: int64

###4.Analysis

#####Most used city based on the sum of the value(billing price)

In [ ]:
 
#Which ones were the most used city for the three days?
#the sum for each product billing price

grouped = df_new.groupby(['VILLES','PRODUCT'])['VALUE'].sum()
grouped

VILLES       PRODUCT
ABENGOUROU   Voice       557
             data          0
             sms           0
ABOBO        Voice      4009
             data         20
                        ...
ZIKISSO      sms           0
ZON-HOUNIEN  Voice        23
             sms           0
ZOUKOUGBEU   Voice        11
ZUENOULA     Voice       163
Name: VALUE, Length: 705, dtype: int64

In [ ]:
#finding the sum of billing price per city and product
grouped = df_new.groupby(['VILLES','DATE_TIME','PRODUCT'])['VALUE'].sum()
grouped

VILLES       DATE_TIME              PRODUCT
ABENGOUROU   2012-05-06 23:14:40.0  sms          0
             2012-05-06 23:15:04.0  data         0
             2012-05-06 23:15:09.0  data         0
             2012-05-06 23:15:34.0  Voice       14
             2012-05-06 23:15:41.0  Voice      152
                                              ...
ZON-HOUNIEN  2012-05-07 00:01:26.0  Voice       23
                                    sms          0
ZOUKOUGBEU   2012-05-07 00:01:26.0  Voice       11
ZUENOULA     2012-05-07 00:01:10.0  Voice       44
             2012-05-07 00:01:26.0  Voice      119
Name: VALUE, Length: 1512, dtype: int64

In [ ]:
#Average billing rate
df_new['VALUE'].mean()

25.54869026194761

In [ ]:
#grouping dataset based on datetime and value
grouped = df_new.groupby(['VILLES','DATE_TIME','PRODUCT'])['VALUE'].sum()
grouped

VILLES       DATE_TIME              PRODUCT
ABENGOUROU   2012-05-06 23:14:40.0  sms          0
             2012-05-06 23:15:04.0  data         0
             2012-05-06 23:15:09.0  data         0
             2012-05-06 23:15:34.0  Voice       14
             2012-05-06 23:15:41.0  Voice      152
                                              ...
ZON-HOUNIEN  2012-05-07 00:01:26.0  Voice       23
                                    sms          0
ZOUKOUGBEU   2012-05-07 00:01:26.0  Voice       11
ZUENOULA     2012-05-07 00:01:10.0  Voice       44
             2012-05-07 00:01:26.0  Voice      119
Name: VALUE, Length: 1512, dtype: int64